testing.org
#+TITLE: Multi-scale code testing
#+AUTHOR: Oleg Shalaev
#+EMAIL:  oleg@chalaev.com

* Testing concept
For me code testing resembles testing an apple before deciding if I want to eat it.

1. First, we should perform microscopic tests, that is, find out if the concentration of dangerous atomic kernels (such as heavy metals or radioactive isotopes) is elevated.
   For software this means testing small independent blocks of software. For software (but not for apple) this is the simplest testing type; this is why it comes first.

2. The next ("mesoscopic") step would be to check if the apple is poisoned with dangerous chemical compounds.
   For software this means testing larger-scale blocks of code that involve interaction of elementary "microscopic" blocks that we have tested on previous step.

3. Finally, if our apple is not radioactive or toxic, we look on how it looks: does it actually look like a healthy apple should?
   For example, does it have spherical form and appropriate color?
   For software this means testing behavior of the entire system and answering questions like "does it install flawlessly?"
   I will call this kind of tests "macroscopic".

All kinds of tests are equally important: sometimes an open-source program is reliable, but user-unfriendly;
or proprietary software may have fancy design but contain back doors.

Microscopic tests are written in [[file:tests/tests/micro.el][micro.el]],
mesoscopic ones – in [[file:generated/tests/meso.el][meso.el]], and
macroscopic ones can be found in [[file:generated/tests/macro.el][macro.el]].

* Helper code
We will define =ert/on-success= in test macros for cleaning up.
Cleaning up when the test is passed:
#+BEGIN_SRC emacs-lisp :tangle tests/ert.el :shebang ";; ert.el"
(defun ert/on-success()
  "cleaning temporary directories"
  (ifn root-test-dir (clog :error "root-test-dir unset in ert/on-success")
    (if(string= root-test-dir (file-name-as-directory(getenv "HOME"))) (clog :error "WTF? Home directory is used in the test!")
#+END_SRC
← a necessary precaution.
#+BEGIN_SRC emacs-lisp :tangle tests/ert.el
    (clog :info "erasing %s" root-test-dir)
    (delete-directory root-test-dir t))))
(defun ert/when-passed()
  (when(functionp 'ert/on-success) (funcall #'ert/on-success)))
(add-function :before (symbol-function 'ert-pass) #'ert/when-passed)
#+END_SRC

* Preparing test environment
For testing we need to use some kind of poor man's "virtual environment":
- all test-related files are localized to =root-test-dir= which is erased in case when all tests are successful
- host is defined via variables in =environment= macro which is going to be overwritten in debug session

#+BEGIN_SRC emacs-lisp :tangle tests/prepare.el :shebang ";; prepare.el"
(require 'shalaev)
(defvar root-test-dir (file-name-as-directory(make-temp-file "cloud.test." t)) "root directory for all tests")
#+END_SRC
Now let us create two virtual hosts named "hostA" and "hostB":
#+BEGIN_SRC emacs-lisp :tangle tests/prepare.el
(let(
(hostnames '("hostA" "hostB")); values of the localhost variable
(remote-directory (need-dir root-test-dir "mnt/remote")); remote directory is mounted differently on different hosts
(remote/files "AbC")
(password "12345"))
(write-conf(untilde (FN debug-make-dir "tests" "common.conf"))
 (make-conf root-test-dir hostnames remote-directory remote/files password))
#+END_SRC
← creates =tests.conf= file in the [[file:tests][test directory]].

Each host has a set of parameters:
#+BEGIN_SRC emacs-lisp :tangle tests/prepare.el
(dolist(localhost hostnames)
(let*((signature localhost); [was (rand-str 3)] distinguishes files having the same name, but residing on different hosts
(s(format "
%s
" signature))
(configured "yes")
(~ (need-dir root-test-dir localhost))
(emacs-d (tilde(need-dir ~ ".emacs.d")))
(*config-directory* (tilde(need-dir emacs-d "conf"))); overwrites the definition in ~/.emacs.d/local-packages/shalaev.el
(local-dir (need-dir *config-directory* "cloud"))
(local/host/conf (concat local-dir localhost ".conf"))
(dot-dir (tilde(need-dir ~ (concat ".config-dir." signature)))); an example of hidden directory – all files inside =dot-dir= are blacklisted
(dir-1   (tilde(need-dir ~ (concat "dir-1." signature))))
(dir-1a  (tilde(need-dir ~ "dir-1a")))
(dot-file  (tilde(echo-to-file (concat "~/.bash-config." signature) (concat "(blacklisted) dot-file" s))))
(conf-file (tilde(echo-to-file (concat dot-dir "file." signature) "any non-whitelisted file inside blacklisted directory is blacklisted")))
(tmp-file  (tilde(echo-to-file (concat "~/tmp-1." signature) "blacklisted")))
(file-1    (tilde(echo-to-file (concat "~/file-1." signature) (concat "an ordinary file (missing on another host)" s))))
(file-1a   (tilde(echo-to-file "~/file-1a.dat" (concat "an ordinary file; there is a file with the same name (but different content) on another host)" s))))
(file-2 (tilde(echo-to-file (concat  "~/tmp-2." signature) (concat "blacklisted " signature)))); blacklisted
(black-root-dirs(mapcar #'(lambda(DN)(concat root-test-dir signature DN)) (split-string "/mnt/ /tmp/ /etc/ /ssh:")))
(black-matches (split-string "tmp /old /log /Downloads /.git/")); the same for both hosts
(black-extensions (split-string "aux idx ilg ind bak bbl blg brf bst dvi log out ps wav")))
#+END_SRC

For each host we create config-files.
Defining the host:
#+BEGIN_SRC emacs-lisp :tangle tests/prepare.el
(write-conf (untilde (FN root-test-dir (concat localhost ".conf")))
  (make-conf localhost ~ emacs-d *config-directory* local-dir local/host/conf dot-dir dir-1 dir-1a dot-file conf-file tmp-file file-1 file-1a file-2))
#+END_SRC
Defining parameters read by [[file:packaged/cloud.el][cloud.el]]:
#+BEGIN_SRC emacs-lisp :tangle tests/prepare.el
(write-conf (untilde local/host/conf)
  (make-conf configured remote-directory remote/files password)))))
#+END_SRC
← these =.conf= files will be loaded inside =(defun hostA() …)= defining =let-conf= environment that wraps [[file:generated/main.el][main.el]].

* Setup (load) test environment
[[file:tests/common.el][tests/common.el]] is used in all tests and is loaded the first:
#+BEGIN_SRC emacs-lisp :tangle tests/common.el :shebang ";; -*-  lexical-binding: t; -*-"

;; common.el – *first* file to be loaded
;; (require 'shalaev)

(require 'el-debug); debug-make-dir must be defined in Makefile
(load(FN debug-make-dir "tests" "ert.el")); debug-make-dir must be defined in Makefile

(if(and(boundp 'debug-make-dir) debug-make-dir)
  (setf debug-make-dir(file-name-as-directory debug-make-dir))
  (clog :error "debug-make-dir is either undefined or nil"))
#+END_SRC

Let us read configuration files prepared in [[file:tests/prepare.el][prepare.el]] only once and store them in global variables:
#+BEGIN_SRC emacs-lisp :tangle tests/common.el
(defvar debug-main-conf (read-conf-file (FN debug-make-dir "tests" "common.conf")) "prepared in tests/prepare.el")
(defvar root-test-dir nil "temporary directory for all virtual hosts")
(debug-set debug-main-conf root-test-dir)

(defmacro debug-environment(&rest body)
"sets most common variables"
`(letc debug-main-conf; global test configuration (common for all hosts)
(remote-directory remote/files password root-test-dir ((:string) hostnames))
(clean-RD remote-directory)
,@body))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle tests/common.el
(defvar debug-host-confs
  (mapcar #'(lambda(HN)(cons HN (read-conf-file (FN root-test-dir (concat HN ".conf")))))
    (letc debug-main-conf (((:string) hostnames)) hostnames)))
#+END_SRC
The following =defvar= is a subtle issue:
#+BEGIN_SRC emacs-lisp :tangle tests/common.el
(defvar debug-host-conf nil "this global definition needed for loaded main file"); 
(defmacro host>(HN &rest body); HN = "host name"
"to be called inside debug-environment"
`(ifn-let((debug-host-conf(cdr(assoc ,HN debug-host-confs))))
(clog :error "host %s is unconfigured" ,HN)
(load(FN debug-make-dir "tests" "cloud.el")); ← loading main file
(letc debug-host-conf (localhost ~ emacs-d *config-directory* local-dir local/host/conf dot-dir dir-1 dir-1a dot-file conf-file tmp-file file-1 file-1a file-2)
,@body
(clog :debug "leaving %s with these files in %s:
%s" ,HN remote-directory (together(directory-files remote-directory nil))))))

(defmacro debug-set*(&rest var-names)
`(debug-set (append debug-main-conf debug-host-conf) ,@var-names))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle tests/common.el
(defmacro clean-RD(dir)
"cleans remote directory by deleting and re-creating it"
`(ifn(string-prefix-p "/tmp/" ,dir) (clog :error "test cloud-init> remote-directory= %s must be inside tmp!" remote-directory)
(delete-directory ,dir t)
(need-dir ,dir)))
#+END_SRC

* Testing on different scales
