testing.org
*** Manually clouding a file
Copying from hostA to hostB file that did not exist on hostB:
#+BEGIN_SRC emacs-lisp :tangle tests/macro-0.el
(ert-deftest cloud-sync-1()
"copying one file from hostA to hostB"
(debug-environment; ← defines variables: hostnames remote-directory remote/files password
(let(FN file-content)
(host> (car hostnames)
(clog :debug "checking that %s exists on host A:" (setf FN file-1))
(should (file-exists-p (untilde FN)))
(setf file-content (cat-file(untilde file-1)))
(cloud-start)
(cloud-add file-1)
(cloud-sync))
(clog :info "finished with host %s, switching to %s" (car hostnames) (cadr hostnames))
(host> (cadr hostnames)
(clog :debug "checking that %s DOES NOT exist on %s BEFORE SYNCING:" FN (cadr hostnames))
(should(not (file-exists-p (untilde FN))))
(cloud-start)
(should(file-exists-p (untilde FN))); so now file-1 exists on-hostB
(should(string= file-content (cat-file (untilde FN))))))))
#+END_SRC
Copying from hostA to hostB file that did exist on hostB:
#+BEGIN_SRC emacs-lisp :tangle tests/macro-0.el
(ert-deftest cloud-sync-2()
"copying one file from hostA to hostB"
(debug-environment
(let(file-content)
(host> (car hostnames)
  (setf file-content (cat-file (untilde file-1a)))
  (cloud-start)
  (clog :info "touch 'now + 5 sec' %s" file-1a) 
  (set-file-times (untilde file-1a) (time-add (current-time) 5))
  (cloud-add file-1a)
  (cloud-sync))
(host> (cadr hostnames)
  (should(file-exists-p (untilde file-1a)))
  (should(not(string= file-content (cat-file (untilde file-1a))))); files file-1a on two hostnames have the same name, but different content
  (cloud-start); cloud-start calls cloud-sync that has downloaded file-1a from remote directory
  (should(string= file-content (cat-file (untilde file-1a))))))))
#+END_SRC

*** Renaming
#+BEGIN_SRC emacs-lisp :tangle tests/macro-1.el
(require 'dired-aux)
(ert-deftest rename-file()
"renaming file on hostA leads to the same action on hostB"
(let(FN1 BN1 DN1 FN2)
(debug-environment
;; (clean-RD remote-directory) it is already in =debug-environment=!
(host> (car hostnames)
    (clog :info "initializing host %s before mirroring files and actions" localhost)
    (cloud-start))
(host> (cadr hostnames)
    (clog :info "initializing host %s before mirroring files and actions" localhost)
    (cloud-start))
(host> (car hostnames)
(debug-clouded-hosts hostnames); our (rename) action will only be performed on already clouded hosts
    (setf FN1 (tilde file-1a))
    (setf DN1 (file-name-directory FN1))
    (setf BN1 (file-name-nondirectory FN1))
    (should(file-exists-p (untilde file-1)))
    (setf FN2 (tilde (concat DN1 "new-" BN1)))
    (clog :info "FN1= %s BN1= %s, DN1= %s, FN2= %s" FN1 BN1 DN1 FN2)
;; :info 19:38:12 FN1= ~/dir-1a/ BN1= dir-1a/, DN1= ~/, FN2= ~/new-dir-1a/
    (should(= 0 (length (debug-remote-actions))))
    (dired-rename-file (tilde FN1) (tilde FN2) t)
    (should(= 1 (length (debug-remote-actions))))
    (clog :info "rename action: %s" (format-action(car(debug-remote-actions))))
    ;; → raw rename action: ...
    (cloud-sync))
(clog :info "finished with host %s, switching to %s" (car hostnames) (cadr hostnames))
(host> (cadr hostnames)
    (clog :info "file1= %s" file-1a)
    (should(file-exists-p (untilde file-1a)))
    (should(file-exists-p (untilde FN1)))
    (should(not(file-exists-p (untilde FN2))))
    (cloud-start)
    (should(file-exists-p (untilde FN2)))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle tests/macro-2.el
(ert-deftest rename-directory()
  "same as rename-file, but for directories"
(let(FN1 BN1 DN1 FN2)
(debug-environment 
;; (clean-RD remote-directory) it is already in =debug-environment=!
(host> (car hostnames)
    (clog :info "initializing host %s before mirroring files and actions" localhost)
    (cloud-start))
(host> (cadr hostnames)
    (clog :info "initializing host %s before mirroring files and actions" localhost)
    (cloud-start))
(host> (car hostnames)
(debug-clouded-hosts hostnames); our (rename) action will only be performed on already clouded hosts
    (setf FN1 (file-name-as-directory(tilde dir-1a)))
    (setf DN1 (file-name-directory(directory-file-name FN1)))
    (setf BN1 (file-name-as-directory(file-name-nondirectory(directory-file-name FN1))))
    (should(file-exists-p (untilde dir-1)))
    (setf FN2 (tilde(file-name-as-directory(concat DN1 "new-" BN1))))
    (clog :info "FN1= %s BN1= %s, DN1= %s, FN2= %s" FN1 BN1 DN1 FN2)
    (should(= 0 (length (debug-remote-actions))))
    (clog :debug "dired-rename-file %s --> %s" (directory-file-name(tilde FN1)) (directory-file-name(tilde FN2)))
    (dired-rename-file (directory-file-name(tilde FN1)) (directory-file-name(tilde FN2)) t)
    (should(= 1 (length (debug-remote-actions))))
    (clog :info "rename action: %s" (format-action(car(debug-remote-actions))))
    (cloud-sync))
(clog :info "finished with host %s, switching to %s" (car hostnames) (cadr hostnames))
(host> (cadr hostnames)
    (clog :info "file1= %s" dir-1a)
    (should(file-exists-p (untilde dir-1a)))
    (should(file-exists-p (untilde FN1)))
    (should(not(file-exists-p (untilde FN2))))
    (cloud-start)
    (should(file-exists-p (untilde FN2)))))))
#+END_SRC
